# Домашнее задание №2

# Задание 2 (12 в файле)
print("Эта программа выводит следующее и предыдущее число от того, что вы введете.\n")
num = int(input("Введите нужное натуральное число: "))
print("Следующиме числом от числа", num, "является", num+1, "\n"
      "Предыдущим числом от числа", num, "является", num-1)
