# Домашнее задание №2

# Задание 1 (9)
print("n школьников делят k яблок поровну, неделящийся остаток остается в корзинке.\n"
      " Эта программа вычислит, сколько яблок досталось каждому школьнику и сколько осталось в корзине.\n")
n = int(input("Введите кол-во школьников"))
k = int(input("Введите кол-во яблок"))
