# Домашнее задание №2

# Задание 2 (12 в файле)
print("Эта программа выводит следующее и предыдущее число от того, что вы введете.\n")
num = int(input("Введите нужное натуральное число: "))
print("Следующее число от числа", num, ":", )
