"""1. В текстовый файл построчно записаны имя и фамилия учащихся класса и
их оценки.
 ```
 Андрей Говорухи 6 6 1 4 9 9 10 4 8 2 3 8
 Василий Петров 2 9 4 7 6 6 3 6 5 5 2 4
 Гавриил Варфаломеев 10 10 4 10 7 9 4 6 8 1 1 1
 Игнат Тюльпанов 8 1 4 1 1 5 2 5 2 2 10 8
 Илья Муромцев 1 6 4 7 10 9 5 3 7 4 7 2
 Кощей Бессмертный 3 10 1 4 1 8 10 6 2 10 7 4
 Максим Мухин 10 8 9 9 5 8 6 5 7 2 4 10
 Маргарита Мартынова 9 1 5 1 10 10 2 4 4 9 8 10
 Петр Николаев 2 9 5 9 1 2 8 7 8 1 9 1
 Полина Гусева 9 2 8 7 3 9 9 5 1 9 2 6
 Спиридов Тереньтьев 4 7 7 3 10 9 7 2 10 9 8 1
 Станислав Трердолобов 8 1 6 1 4 1 10 8 8 1 8 8
 ```
 Вывести на экран всех учащихся, чей средний балл меньше 5, также
посчитать и вывести средний балл по классу. Так же,
 записать в новый файл всех учащихся в формате "Фамилия И.
Ср. балл":
 ```
 Говорухи А. 5.83
 Петров В. 4.92
 Варфаломеев Г. 5.92
 Тюльпанов И. 4.08
 Муромцев И. 5.42
 Бессмертный К. 5.5
 Мухин М. 6.92
 Мартынова М. 6.08
 Николаев П. 5.17
 Гусева Г. 5.83
 Тереньтьев С. 6.42
 Трердолобов С. 5.33
 ```
 Выравнивание колонок - желательно!
 """
from random import randint

vce_ocenki = open('DZ13 Все Оценки.txt', 'w')
bal_sred = open('DZ13 Общий средний балл.txt', 'w')

names = [['Андрей', 'Говорухи'], ['Василий', 'Петров'], ['Илья', 'Муромцев'], ['Кощей', 'Бессмертный'],
         ['Максим', 'Мухин'],
         ['Маргарита', 'Мартынова'], ['Петр', 'Николаев'], ['Полина', 'Гусева'], ['Спиридов', 'Тереньтьев'],
         ['Станислав', 'Трердолобов']]

names.sort(key=lambda x: x[0])  # Сортировка по имени, если понадобится (Для "по фамилии" - изменить х[0] на x[1]

# grades = [randint(1, 10) for i in range(12)]

grades = []
# for i in range(len(names)):
#     grades.append(list(randint(1, 10) for x in range(12)))

for i in range(len(names)):
    grades.append(list(randint(1, 10) for x in range(12)))
    vce_ocenki.write('{:<30}'.format(names[i][0] + ' ' + names[i][1]))
    for j in range(len(grades[i])):
        vce_ocenki.write('{:<3}'.format(grades[i][j]))
    vce_ocenki.write('\n')
vce_ocenki.close()

obshee = 0
for i in range(len(names)):
    summa = 0
    for j in grades[i]:
        summa += j
    if summa / len(grades[i]) < 5:
        print('{} {}'.format(names[i][0], names[i][1]), round(summa / len(grades[i]), 1))
    obshee += summa / len(grades[i])
    bal_sred.write('{:<20}{}'.format(names[i][1] + ' ' + names[i][0][:1] + '.', round(summa / len(grades[i]), 2)))
    bal_sred.write('\n')
print('\nСредний по классу балл -', round(obshee / len(names), 1))

bal_sred.close()
