"""
2. Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения
задачи функцию `count`
"""

# s = input("Введите строку")
s = "раз два три"
print("Слов в введенной строке - ", s.count(" ")+1)
